src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_Урок/Forms/ПомощникСозданияУроков/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//параметры формы на сервере есть только при создании — группу «на неделю» запоминаем до открытия
	ГруппаИзПараметра = Параметры.ГруппаОбучения;
	НайтиДокументыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПриОткрытииНаСервере();

	ОбновитьВидимость();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПродлениеГруппыПриИзменении(Элемент)

	Если ЭтотОбъект.ПродлениеГруппы Тогда
		ДобавлениеВСуществующиеЗанятия 	= Ложь;
	КонецЕсли;

	ОбновитьВидимость();

	ГруппаОбученияПриИзмененииНаСервере(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ГруппаОбученияПриИзменении(Элемент)

	УстановитьВремяВручную = Ложь;

	ГруппаОбученияПриИзмененииНаСервере(Ложь);
	Если ЗаполнятьИзГруппыОбучения И Не ПродлениеГруппы Тогда
		ЗаполнитьУчениковИзГруппы();
	КонецЕсли;

	ОбновитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьИзГруппыОбученияПриИзменении(Элемент)

	Если ЗаполнятьИзГруппыОбучения Тогда
		Элементы.ВремяБратьИзГруппы.Доступность = Истина;
		УстановитьВремяВручную 					= Ложь;
		Элементы.ВремяНачала.Видимость 			= Ложь;
		Элементы.КоличествоЧасов.Видимость 		= Ложь;
		Если ЗначениеЗаполнено(ГруппаОбучения) И Ученики.Количество() = 0 Тогда
			ЗаполнитьУчениковИзГруппы();
		КонецЕсли;
	Иначе
		Элементы.ВремяБратьИзГруппы.Доступность = Ложь;
		УстановитьВремяВручную 					= Истина;
		Элементы.ВремяНачала.Видимость 			= Истина;
		Элементы.КоличествоЧасов.Видимость 		= Истина;
	КонецЕсли;

	ОбновитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ВремяБратьИзГруппыПриИзменении(Элемент)

	Если НЕ УстановитьВремяВручную и ЗначениеЗаполнено(ГруппаОбучения) Тогда
		Элементы.ВремяНачала.Видимость 		= Ложь;
		Элементы.КоличествоЧасов.Видимость 	= Ложь;
	Иначе
		Элементы.ВремяНачала.Видимость 		= Истина;
		Элементы.КоличествоЧасов.Видимость 	= Истина;
	КонецЕсли;

	ВремяНачала = Неопределено;
	КоличествоЧасов = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Страница4 Тогда
		НайтиДокументыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТарифПриИзменении(Элемент)

	ТарифПриИзмененииНаСервере();
	ОбновитьВидимость();

КонецПроцедуры

//A2-01: тариф помощника — тариф строк по правилу новой строки урока (В20): личный тариф ученика остаётся.
&НаСервере
Процедура ТарифПриИзмененииНаСервере()

	Для Каждого Стр Из Ученики Цикл
		Стр.Тариф = Документы.УЗ_Урок.ТарифНовойСтроки(Стр.Ученик, ГруппаОбучения, Тариф);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУченики

&НаКлиенте
Процедура УченикиУченикСоздание(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПараметрыСтроки = Новый Структура;
	ПараметрыСтроки.Вставить("Наименование", СокрЛП(Элемент.ТекстРедактирования));
	ПараметрыСтроки.Вставить("Группа","Ученики");

	Пар = Новый Структура("Ключ2", ПараметрыСтроки);

	ОткрытьФорму("Справочник.УЗ_ФизЛица.Форма.ФормаЭлемента",Пар,ЭтотОбъект,УникальныйИдентификатор,
		ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура УченикиУченикПриИзменении(Элемент)
	ТекДанные = Элементы.Ученики.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(ТекДанные, СкидкаИТарифУченика(ТекДанные.Ученик));
	ЗаполнитьАбонементы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьДействие(Команда)

	Отказ = Ложь;

	ИнформационнаяТЗ.Очистить();

	//«Выполнить» — только с вкладки своего режима: прежде с «Найденных документов» или «Результата» запускались
	//скрытые режимы (продление группы), если их отметки остались в сохранённых настройках формы. Перевод учеников —
	//документ «Перевод ученика» (В29), не помощник
	ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница;
	Если ТекущаяСтраница <> Элементы.Страница1
		И Не (ТекущаяСтраница.Видимость И ТекущаяСтраница = Элементы.Страница2) Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Перейдите на вкладку «Создание уроков» и нажмите «Выполнить» там'"));
		Возврат;
	КонецЕсли;

	Если Элементы.Календарь.ВыделенныеДаты.Количество() = 0 Тогда
		Сообщить("Не выбраны даты уроков!");
		Отказ = Истина;
	КонецЕсли;

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Страница1 Тогда
		Если Ученики.Количество() = 0 Тогда
			Сообщить("Не выбраны ученики!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Состояние("Идет выполение...");
	ВыполнитьНаСервере();

	Оповестить("ЗакрытьФорму");
	Результат = Результат + "Выполнено!"+Символы.ПС;
	Состояние("Завершено!");

	Если ИнформационнаяТЗ.Количество()>0 Тогда
		Элементы.Страницы.ТекущаяСтраница  = Элементы.Страница5;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)

	ГруппаОбучения   				= Неопределено;
	ДобавлениеВСуществующиеЗанятия 	= Истина;
	ПродлениеГруппы				 	= Ложь;
	Помещение						= Неопределено;
	Педагог							= Неопределено;
	ПредметОбучения					= Неопределено;
	ВремяНачала						= '00010101';
	КоличествоЧасов					= '00010101';
	ЗаполнятьИзГруппыОбучения		= Ложь;
	УстановитьВремяВручную			= Истина;
	СтатусУрока						= Неопределено;

	Результат = "";
	Ученики.Очистить();
	ИнформационнаяТЗ.Очистить();
	Элементы.Календарь.ВыделенныеДаты.Очистить();

	ОбновитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура СписатьОплаты(Команда)
	Для Каждого Стр из Ученики Цикл
		Стр.СписатьОплату = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УбратьСписатьОплаты(Команда)
	Для Каждого Стр из Ученики Цикл
		Стр.СписатьОплату = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодборУчеников(Команда)
	УЗ_ОбщийКлиент.ПодобратьУчеников(ЭтотОбъект, Новый ОписаниеОповещения("ПодборУчениковЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура НайтиДокументы(Команда)
	НайтиДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСледующийМесяц(Команда)
	ГруппаОбученияПриИзмененииНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭтотМесяц(Команда)
	НаНеделю = Ложь;
	ГруппаОбученияПриИзмененииНаСервере(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Краткое имя дня недели по номеру (ДеньНедели), а не по строковому виду даты: Формат(Дата, "ДФ=ддд") зависит
//от языка и региональных настроек пользователя.
Функция ИмяДняНедели(Дата)
	Возврат СтрРазделить("Пн,Вт,Ср,Чт,Пт,Сб,Вс", ",")[ДеньНедели(Дата) - 1];
КонецФункции

//Время и длительность урока на дату — по расписанию дня группы, без своего времени у дня — общее (В21,
//Документы.УЗ_Урок.РасписаниеГруппыНаДень, одна функция с формой урока и панелью ученика): ставит «Время начала» и
//«Продолжительность» помощника. День, в который группа не занимается, — строка журнала и Ложь.
Функция ВзятьВремяГруппы(ДатаКалендаря, Группа)

	Расписание = Документы.УЗ_Урок.РасписаниеГруппыНаДень(Группа, ДатаКалендаря);
	Если Расписание = Неопределено Тогда
		ИнформационнаяТЗ.Добавить().Описание =
			СтрШаблон(НСтр("ru = '%1 (%2): у группы %3 в этот день нет занятия по расписанию — пропущено'"),
			Формат(ДатаКалендаря, "ДФ=dd.MM.yyyy"), ИмяДняНедели(ДатаКалендаря), Группа);
		Возврат Ложь;
	КонецЕсли;
	ВремяНачала = '00010101' + (Расписание.Начало - НачалоДня(Расписание.Начало));
	КоличествоЧасов = '00010101' + Окр(Расписание.КоличествоЧасов * 3600);
	Возврат Истина;

КонецФункции

//Параметры урока помощника на дату календаря: начало — дата + «Время начала», длительность — «Продолжительность».
Функция ПараметрыУрокаНаДату(ДатаКалендаря)

	ПараметрыУрока = Новый Структура;
	ПараметрыУрока.Вставить("Дата", ДатаКалендаря - ('00010101' - ВремяНачала));
	ПараметрыУрока.Вставить("КоличествоЧасов", (КоличествоЧасов - '00010101') / 3600);
	ПараметрыУрока.Вставить("ПредметОбучения", ПредметОбучения);
	ПараметрыУрока.Вставить("Педагог", Педагог);
	ПараметрыУрока.Вставить("Помещение", Помещение);
	ПараметрыУрока.Вставить("ГруппаОбучения", ГруппаОбучения);
	ПараметрыУрока.Вставить("Статус", СтатусУрока);
	ПараметрыУрока.Вставить("Тариф", Тариф);
	Возврат ПараметрыУрока;

КонецФункции

//Ученики таблицы помощника — массив структур для Документы.УЗ_Урок.ЗаписатьУчениковВУрок.
Функция ДанныеУчениковПомощника()

	ДанныеУчеников = Новый Массив;
	Для Каждого СтрУченик Из Ученики Цикл
		Если Не ЗначениеЗаполнено(СтрУченик.Ученик) Тогда
			Продолжить;
		КонецЕсли;
		ДанныеУчеников.Добавить(Новый Структура("Ученик, Тариф, Скидка, СписатьОплату, Явка, Абонемент",
			СтрУченик.Ученик, СтрУченик.Тариф, СтрУченик.Скидка, СтрУченик.СписатьОплату, СтрУченик.Явка,
				СтрУченик.Абонемент));
	КонецЦикла;
	Возврат ДанныеУчеников;

КонецФункции

//Строки итога помощника (Документы.УЗ_Урок.ЗаписатьУчениковВУрок) — в таблицу «Результат».
Процедура ПоказатьИтогПомощника(Итог, Пометка)

	Для Каждого СтрокаИтога Из Итог.Строки Цикл
		НовСтр = ИнформационнаяТЗ.Добавить();
		НовСтр.Описание = СтрокаИтога.Описание + Пометка;
		Если ЗначениеЗаполнено(СтрокаИтога.Урок) Тогда
			НовСтр.Урок = СтрокаИтога.Урок;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ВыполнитьНаСервере()

	//время: из расписания группы (группа выбрана, «Заполнять из группы обучения», ручное время не задано)
	//или ручное — тогда начало и продолжительность обязательны (прежде без группы и без времени проверки не было —
	//создавался урок в 00:00 длительностью 0; ручное время при «Заполнять из группы» игнорировалось)
	ВремяИзГруппы = ЗначениеЗаполнено(ГруппаОбучения) И ЗаполнятьИзГруппыОбучения И НЕ УстановитьВремяВручную;
	Если ВремяИзГруппы Тогда
		Если Не ГруппаОбучения.ПН и Не ГруппаОбучения.ВТ и не ГруппаОбучения.СР и не ГруппаОбучения.ЧТ
			и не ГруппаОбучения.ПТ и не ГруппаОбучения.СБ и не ГруппаОбучения.ВС Тогда
			ТекстСообщения = "Не заполнено время по дням неделям в группе обучения!";
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(ВремяНачала) или Не ЗначениеЗаполнено(КоличествоЧасов) Тогда
			ТекстСообщения = "Не заполнено время начала или продолжительность!";
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Страница1 Тогда

		ИнформационнаяТЗ.Добавить().Описание = "Создание уроков и добавление в существующие, "
			+ Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");

		//урок на дату ищется строго: то же начало, группа, педагог, предмет, помещение; нет — создаётся, но не поверх
		//урока того же педагога/помещения/группы (Codex N03); логика — Документы.УЗ_Урок.ЗаписатьУчениковВУрок
		ДанныеУчеников = ДанныеУчениковПомощника();
		Для Каждого Стр из Элементы.Календарь.ВыделенныеДаты Цикл
			Если ВремяИзГруппы И Не ВзятьВремяГруппы(Стр, ГруппаОбучения) Тогда
				Продолжить;
			КонецЕсли;
			Итог = Документы.УЗ_Урок.ЗаписатьУчениковВУрок(ПараметрыУрокаНаДату(Стр), ДанныеУчеников, Не Записывать);
			ПоказатьИтогПомощника(Итог, "");
		КонецЦикла;

	ИначеЕсли ПродлениеГруппы И Элементы.Страница2.Видимость
		И Элементы.Страницы.ТекущаяСтраница = Элементы.Страница2 Тогда

		ИнформационнаяТЗ.Добавить().Описание = "Продление группы, " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");

		//урок на дату — по расписанию дня группы (В21), ученики последнего урока с тарифом по В20 и абонементом на
		//дату урока, проверки конфликтов и В10 — Документы.УЗ_Урок.ПродлитьГруппу (прежде: общее время группы,
		//без абонемента и конфликтов; у группы без уроков — ошибка выполнения)
		Для Каждого СтрокаЖурнала Из Документы.УЗ_Урок.ПродлитьГруппу(ГруппаОбучения,
			Элементы.Календарь.ВыделенныеДаты) Цикл
			НовСтр = ИнформационнаяТЗ.Добавить();
			НовСтр.Описание = СтрокаЖурнала.Описание;
			Если ЗначениеЗаполнено(СтрокаЖурнала.Урок) Тогда
				НовСтр.Урок = СтрокаЖурнала.Урок;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

//Ученики группы на выбранные даты уроков (без дат — на сегодня) с их тарифом (или тарифом группы), скидкой и
//действующим абонементом — одно правило состава с продлением (Документы.УЗ_Урок.УченикиГруппыДляПомощника): без
//выбывших (В18); состав — объединение составов на КАЖДУЮ дату (Codex 3, находка 8: прежде — на первую дату, и
//вступивший в группу позже не попадал ни в один урок). В урок конкретной даты ученика пускает запись урока
//(Документы.УЗ_Урок.ЗаписатьУчениковВУрок: ещё не вступивший или вышедший к дате урока в него не записывается).
&НаСервере
Процедура ЗаполнитьУчениковИзГруппы()

	Ученики.Очистить();
	Если Не ЗначениеЗаполнено(ГруппаОбучения) Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ДанныеУченика Из Документы.УЗ_Урок.УченикиГруппыДляПомощника(ГруппаОбучения, ДатыУроков(),
		Тариф) Цикл
		ЗаполнитьЗначенияСвойств(Ученики.Добавить(), ДанныеУченика);
	КонецЦикла;
	ЗаполнитьАбонементы();

КонецПроцедуры

//Выбранные в календаре даты уроков (Массив), без дат — сегодня.
&НаСервере
Функция ДатыУроков()

	Даты = Новый Массив;
	Для Каждого ДатаКалендаря Из Элементы.Календарь.ВыделенныеДаты Цикл
		Даты.Добавить(ДатаКалендаря);
	КонецЦикла;
	Если Даты.Количество() = 0 Тогда
		Даты.Добавить(ТекущаяДатаСеанса());
	КонецЕсли;
	Возврат Даты;

КонецФункции

//Первая выбранная в календаре дата урока, без дат — сегодня.
&НаСервере
Функция ПерваяДатаУроков()

	ДатаПодбора = ТекущаяДатаСеанса();
	Если Элементы.Календарь.ВыделенныеДаты.Количество() > 0 Тогда
		ДатаПодбора = Элементы.Календарь.ВыделенныеДаты[0];
		Для Каждого ДатаКалендаря Из Элементы.Календарь.ВыделенныеДаты Цикл
			ДатаПодбора = Мин(ДатаПодбора, ДатаКалендаря);
		КонецЦикла;
	КонецЕсли;
	Возврат ДатаПодбора;

КонецФункции

//Абонемент и его остаток в таблице учеников — на первую выбранную дату (без дат — на сегодня), теми же функциями,
//что урок (Справочники.УЗ_Абонемент.ПодобратьАбонемент). Это подсказка: при записи каждого урока абонемент
//подбирается заново на дату ЭТОГО урока (Документы.УЗ_Урок.ЗаписатьУчениковВУрок) — на дни паузы, после
//окончания или исчерпания в уроке будет другой абонемент или тариф.
&НаСервере
Процедура ЗаполнитьАбонементы()

	ДатаПодбора = ПерваяДатаУроков();
	Часов = (КоличествоЧасов - '00010101') / 3600;
	Организация = РегистрыСведений.УЗ_Настройки.Настройки().Организация;
	Для Каждого СтрУченик Из Ученики Цикл
		Подбор = Справочники.УЗ_Абонемент.ПодобратьАбонемент(СтрУченик.Ученик, ПредметОбучения, ДатаПодбора,
			Организация, Часов);
		СтрУченик.Абонемент = Подбор.Абонемент;
		Если ЗначениеЗаполнено(Подбор.Абонемент) Тогда
			СтрУченик.ОстатокАбонемента = Справочники.УЗ_Абонемент.ТекстОстатка(Подбор.Абонемент);
		ИначеЕсли ЗначениеЗаполнено(Подбор.Исчерпанный) Тогда
			СтрУченик.ОстатокАбонемента = НСтр("ru = 'исчерпан — по тарифу'");
		ИначеЕсли ЗначениеЗаполнено(Подбор.Приостановленный) Тогда
			СтрУченик.ОстатокАбонемента = НСтр("ru = 'приостановлен — по тарифу'");
		Иначе
			СтрУченик.ОстатокАбонемента = "";
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ГруппаОбученияПриИзмененииНаСервере(СледМесяц)

	Элементы.Календарь.ВыделенныеДаты.Очистить();

	Если ЗначениеЗаполнено(ЭтотОбъект.ГруппаОбучения) Тогда

		ЗаполнятьИзГруппыОбучения = Истина;

		Если ЭтотОбъект.ГруппаОбучения.ПН Тогда
			ДобавитьВСписок(1,"Календарь",СледМесяц);
		КонецЕсли;
		Если ЭтотОбъект.ГруппаОбучения.ВТ Тогда
			ДобавитьВСписок(2,"Календарь",СледМесяц);
		КонецЕсли;
		Если ЭтотОбъект.ГруппаОбучения.СР Тогда
			ДобавитьВСписок(3,"Календарь",СледМесяц);
		КонецЕсли;
		Если ЭтотОбъект.ГруппаОбучения.ЧТ Тогда
			ДобавитьВСписок(4,"Календарь",СледМесяц);
		КонецЕсли;
		Если ЭтотОбъект.ГруппаОбучения.ПТ Тогда
			ДобавитьВСписок(5,"Календарь",СледМесяц);
		КонецЕсли;
		Если ЭтотОбъект.ГруппаОбучения.СБ Тогда
			ДобавитьВСписок(6,"Календарь",СледМесяц);
		КонецЕсли;
		Если ЭтотОбъект.ГруппаОбучения.ВС Тогда
			ДобавитьВСписок(7,"Календарь",СледМесяц);
		КонецЕсли;

		Если ДобавлениеВСуществующиеЗанятия Тогда

			//ученики с «Только выбранные группы» из состава группы на даты уроков — без выбывших (В18) и тех,
			//чья строка группы ни на одну дату не действует (прежде — все строки группы без дат и отметки «Выбыл»).
			//Повторное заполнение («Заполнить этот/след. месяц», открытие формы) не дописывает тех, кто уже есть
			//(прежде ученик попадал в урок дважды — двойное списание денег и абонемента)
			Для Каждого ДанныеУченика Из Документы.УЗ_Урок.УченикиГруппыДляПомощника(ГруппаОбучения,
				ДатыУроков(), ГруппаОбучения.Тариф, Истина) Цикл
				Если Ученики.НайтиСтроки(Новый Структура("Ученик", ДанныеУченика.Ученик)).Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(Ученики.Добавить(), ДанныеУченика);
			КонецЦикла;

		КонецЕсли;

		Педагог 		= ЭтотОбъект.ГруппаОбучения.Педагог;
		ПредметОбучения = ЭтотОбъект.ГруппаОбучения.ПредметОбучения;
		ВремяНачала 	= ЭтотОбъект.ГруппаОбучения.Время;
		КоличествоЧасов = ЭтотОбъект.ГруппаОбучения.Продолжительность;
		Помещение 		= ЭтотОбъект.ГруппаОбучения.Помещение;
		Тариф 			= ЭтотОбъект.ГруппаОбучения.Тариф;

	Иначе

		ЗаполнятьИзГруппыОбучения = Ложь;

	КонецЕсли;

	Если ЗначениеЗаполнено(ГруппаОбучения) и ПродлениеГруппы Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Урок.Ссылка,
		|	Урок.Дата КАК Дата
		|ИЗ
		|	Документ.УЗ_Урок КАК Урок
		|ГДЕ
		|	НЕ Урок.ПометкаУдаления
		|	И Урок.ГруппаОбучения = &ГруппаОбучения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("ГруппаОбучения", ГруппаОбучения);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Ученики.Очистить();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Для Каждого Стр из ВыборкаДетальныеЗаписи.Ссылка.Ученики Цикл
				НовСтрУч = Ученики.Добавить();
				НовСтрУч.Ученик = Стр.Ученик;
				НовСтрУч.Тариф 	= Документы.УЗ_Урок.ТарифНовойСтроки(Стр.Ученик, ГруппаОбучения, Стр.Тариф);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	Если ЗначениеЗаполнено(ГруппаОбучения) Тогда
		ЗаполнитьАбонементы();
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьВСписок(ДеньНедели, Календ, СледМесяц)

	//открыт с группой «на неделю» (УЗ_ПервыйЗапуск): дни занятий по расписанию группы на 7 дней вперёд —
	//одна функция с тестом первого запуска (Документы.УЗ_Урок.ДатыЗанятийГруппы)
	Если НаНеделю И Не СледМесяц Тогда
		Для Каждого ДатаЗанятия Из Документы.УЗ_Урок.ДатыЗанятийГруппы(ГруппаОбучения, ТекущаяДатаСеанса(), 7) Цикл
			Если ДеньНедели(ДатаЗанятия) = ДеньНедели Тогда
				Элементы[Календ].ВыделенныеДаты.Добавить(ДатаЗанятия);
			КонецЕсли;
		КонецЦикла;
		Возврат;
	КонецЕсли;

	Если СледМесяц Тогда
		ДатаНач 	= КонецМесяца(ТекущаяДатаСеанса())+1;
	Иначе
		ДатаНач 	= ТекущаяДатаСеанса();
	КонецЕсли;

	ДатаКонец 	= КонецМесяца(ДатаНач);
	Пока ДатаНач <= ДатаКонец Цикл
		Если ДеньНедели(ДатаНач) = ДеньНедели Тогда
			Элементы[Календ].ВыделенныеДаты.Добавить(НачалоДня(ДатаНач));
		КонецЕсли;
		ДатаНач = ДатаНач +86400;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()

	Элементы.ВремяНачала.Доступность 		= Истина;
	Элементы.КоличествоЧасов.Доступность 	= Истина;

	//введённое время не стираем: обновление видимости вызывает и смена тарифа (прежде время обнулялось)

	Если ЗаполнятьИзГруппыОбучения Тогда
		Элементы.Помещение.Доступность 			= Ложь;
		Элементы.Педагог.Доступность 			= Ложь;
		Элементы.ПредметОбучения.Доступность 	= Ложь;
		Элементы.ВремяНачала.Видимость 			= Ложь;
		Элементы.КоличествоЧасов.Видимость 		= Ложь;
		Элементы.Тариф.Доступность 				= Ложь;
	Иначе
		Элементы.Помещение.Доступность 			= Истина;
		Элементы.Педагог.Доступность 			= Истина;
		Элементы.ПредметОбучения.Доступность 	= Истина;
		Элементы.Тариф.Доступность 				= Истина;
	КонецЕсли;

	Если НЕ УстановитьВремяВручную Тогда
		Элементы.ВремяНачала.Видимость 		= Ложь;
		Элементы.КоличествоЧасов.Видимость 	= Ложь;
	Иначе
		Элементы.ВремяНачала.Видимость 		= Истина;
		Элементы.КоличествоЧасов.Видимость 	= Истина;
	КонецЕсли;

	ОбновитьВидимостьНаСервере();

КонецПроцедуры

Процедура ОбновитьВидимостьНаСервере()

	Если ЗаполнятьИзГруппыОбучения Тогда

		//ручное время по умолчанию — время группы, но введённое пользователем не затираем
		Если УстановитьВремяВручную И Не ЗначениеЗаполнено(ВремяНачала) Тогда
			ВремяНачала 	= ГруппаОбучения.Время;
		КонецЕсли;
		Если УстановитьВремяВручную И Не ЗначениеЗаполнено(КоличествоЧасов) Тогда
			КоличествоЧасов = ГруппаОбучения.Продолжительность;
		КонецЕсли;

		Педагог			= ГруппаОбучения.Педагог;
		Помещение		= ГруппаОбучения.Помещение;
		ПредметОбучения	= ГруппаОбучения.ПредметОбучения;
		Тариф			= ГруппаОбучения.Тариф;

	КонецЕсли;

	Если НЕ Тариф.Пустая() Тогда
		//цена — по тем же правилам, что при проведении урока: карточка тарифа без истории цен
		//или история цен (раньше смотрели только историю — и писали «нет цен» при цене в карточке)
		Цена = Документы.УЗ_Урок.ЦенаТарифаНаДату(Тариф, ТекущаяДатаСеанса());
		//справка о цене — серым поясняющим текстом; красным (цвет минуса палитры) — только «нет цены»
		Элементы.Декорация3.ЦветТекста = ?(Цена = Неопределено, УЗ_ОбщийКлиентСервер.ЦветМинусаДенег(),
			УЗ_ОбщийКлиентСервер.ЦветПояснения());
		//та же подсказка, что у тарифа и записи цены: сначала «за урок», затем «за час» — как считает урок
		Элементы.Декорация3.Заголовок = ?(Цена = Неопределено,
			НСтр("ru = 'У тарифа нет цены на сегодня. Укажите цену в карточке тарифа'"),
			УЗ_ОбщийКлиентСервер.ПредставлениеЦеныТарифа(Цена));

	КонецЕсли;

КонецПроцедуры

//Параметр формы ГруппаОбучения («Создать уроки на неделю» помощника первого запуска УЗ_ПервыйЗапуск): группа,
//её ученики и дни занятий по расписанию на 7 дней вперёд с сегодняшнего. Применяется при открытии, а не при
//создании формы: сохранённые настройки формы (последняя группа) восстанавливаются после ПриСозданииНаСервере.
&НаСервере
Процедура ПриОткрытииНаСервере()

	Если ЗначениеЗаполнено(ГруппаИзПараметра) Тогда
		ГруппаОбучения = ГруппаИзПараметра;
		ГруппаИзПараметра = Справочники.УЗ_ГруппыОбучения.ПустаяСсылка();
		НаНеделю = Истина;
		ДобавлениеВСуществующиеЗанятия = Ложь;
		ПродлениеГруппы = Ложь;
		УстановитьВремяВручную = Ложь;
		ГруппаОбученияПриИзмененииНаСервере(Ложь);
		ЗаполнитьУчениковИзГруппы();
	Иначе
		ГруппаОбученияПриИзмененииНаСервере(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодборУчениковЗавершение(Результат,Параметры) Экспорт
	Если Результат <> Неопределено Тогда
		ДобавитьПодобранныхУчеников(Результат);
		ЗаполнитьАбонементы();
	КонецЕсли;
КонецПроцедуры

Процедура НайтиДокументыНаСервере()

	ТипДаты = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	Интервалы = Новый ТаблицаЗначений;
	Интервалы.Колонки.Добавить("НачалоИнтервала", ТипДаты);
	Интервалы.Колонки.Добавить("КонецИнтервала", ТипДаты);
	Для Каждого Стр из Элементы.Календарь.ВыделенныеДаты Цикл
		Интервал = Интервалы.Добавить();
		Если ЗаполнятьИзГруппыОбучения Тогда
			Расписание = Документы.УЗ_Урок.РасписаниеГруппыНаДень(ГруппаОбучения, Стр);
			Если Расписание = Неопределено Тогда
				Интервалы.Удалить(Интервал);
				Продолжить;
			КонецЕсли;
			Интервал.НачалоИнтервала = Расписание.Начало;
			Интервал.КонецИнтервала = Расписание.Начало + Окр(Расписание.КоличествоЧасов * 3600);
		Иначе
			Интервал.НачалоИнтервала = Стр - ('00010101' - ВремяНачала);
			Интервал.КонецИнтервала = Интервал.НачалоИнтервала - ('00010101' - КоличествоЧасов);
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Интервалы.НачалоИнтервала КАК НачалоИнтервала,
	|	Интервалы.КонецИнтервала КАК КонецИнтервала
	|ПОМЕСТИТЬ Интервалы
	|ИЗ
	|	&Интервалы КАК Интервалы
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Урок.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Интервалы КАК Интервалы
	|		ПО Урок.Дата >= Интервалы.НачалоИнтервала
	|			И Урок.Окончание <= Интервалы.КонецИнтервала
	|ГДЕ
	|	НЕ Урок.ПометкаУдаления
	|	И Урок.ПредметОбучения = &ПредметОбучения
	|	И Урок.Помещение = &Помещение";
	Запрос.УстановитьПараметр("Интервалы", Интервалы);
	Запрос.УстановитьПараметр("ПредметОбучения", ПредметОбучения);
	Запрос.УстановитьПараметр("Помещение", Помещение);
	МассивУроков = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	НайденныеДокументы2.Отбор.Элементы.Очистить();
	ЭлементОтбора = НайденныеДокументы2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = МассивУроков;
	ЭлементОтбора.Использование = Истина;
	Элементы.НайденныеДокументы2.Обновить();
КонецПроцедуры

//Скидка из карточки ученика и тариф новой строки — ученика, иначе группы, иначе помощника (В20: прежде строка
//оставалась без тарифа). Структура(Скидка, Тариф) — одним вызовом сервера.
&НаСервере
Функция СкидкаИТарифУченика(Ученик)

	Возврат Новый Структура("Скидка, Тариф", Ученик.Скидка,
		Документы.УЗ_Урок.ТарифНовойСтроки(Ученик, ГруппаОбучения, Тариф));

КонецФункции

//Строки подобранных учеников: скидка из карточки; тариф — ученика, иначе группы, иначе помощника (В20: прежде
//строка оставалась без тарифа). Один вызов сервера на весь подбор (прежде — два на каждого ученика).
&НаСервере
Процедура ДобавитьПодобранныхУчеников(Знач Выбранные)

	Для Каждого Ученик Из Выбранные Цикл
		НоваяСтрока = Ученики.Добавить();
		НоваяСтрока.Ученик = Ученик;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СкидкаИТарифУченика(Ученик));
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
